{
 "metadata": {
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.2-final"
  },
  "orig_nbformat": 2,
  "kernelspec": {
   "name": "python3",
   "display_name": "Python 3.8.2 64-bit ('py38')",
   "metadata": {
    "interpreter": {
     "hash": "c90655714ffb9d69d923b994a9a952fe34a64a031cf84cba975d9030ad2b344f"
    }
   }
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2,
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "from py2neo import Graph\n",
    "from igraph import Graph as IGraph\n",
    "from pprint import pprint"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "# graph = Graph()\n",
    "graph = Graph('bolt://127.0.0.1:7687', password='jojo')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "output_type": "execute_result",
     "data": {
      "text/plain": [
       "[{'m': Node('Stock', code='2330', community=1, market='上市', name='台積電', pagerank=0.0027551025841649575, stock_id='2330')}]"
      ]
     },
     "metadata": {},
     "execution_count": 3
    }
   ],
   "source": [
    "# 查詢台GG\n",
    "query = '''\n",
    "match (m:Stock{code:'2330'}) return m\n",
    "'''\n",
    "graph.run(query).data()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "output_type": "execute_result",
     "data": {
      "text/plain": [
       " count(distinct(n)) \n",
       "--------------------\n",
       "                123 "
      ]
     },
     "metadata": {},
     "execution_count": 4
    }
   ],
   "source": [
    "# Concept(概念股)種類的總數\n",
    "query = '''\n",
    "match (n:Concept) return count(distinct(n))\n",
    "'''\n",
    "\n",
    "graph.run(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "output_type": "execute_result",
     "data": {
      "text/plain": [
       "[{'n': Node('Person', community=4, name='林錦坤', pagerank=2.158779021990127e-05, person_id='ee0bfbd63337a74c1c9353f2f5cff5d3'),\n",
       "  'count(distinct(n))': 1},\n",
       " {'n': Node('Person', community=294, name='余振華', pagerank=2.280606193013153e-05, person_id='2dc7f8de9ca02c34a3e90b0565b4559a'),\n",
       "  'count(distinct(n))': 1}]"
      ]
     },
     "metadata": {},
     "execution_count": 5
    }
   ],
   "source": [
    "# GG有多少副總在其他公司也是董監事經理人或大股東\n",
    "query = '''\n",
    "MATCH (m:Stock{code:'2330'})<-[:employ_of{jobs:'副總'}]-(n:Person)-[:employ_of]->(q:Stock)\n",
    "RETURN n, count(distinct(n))\n",
    "'''\n",
    "\n",
    "graph.run(query).data()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "output_type": "stream",
     "name": "stdout",
     "text": [
      "[igraph.Vertex(<igraph.Graph object at 0x107fe29a0>, 0, {'name': Node('Person', community=4, name='摩西．蓋弗瑞', pagerank=1.2507701764504113e-05, person_id='f7e8a7073af3c121a18aba032a2b1a04')}),\n igraph.Vertex(<igraph.Graph object at 0x107fe29a0>, 1, {'name': 1}),\n igraph.Vertex(<igraph.Graph object at 0x107fe29a0>, 2, {'name': Node('Person', community=4, name='麥克。史賓林', pagerank=1.2507701764504113e-05, person_id='427f0333d16f224bedea4570e6cd9410')}),\n igraph.Vertex(<igraph.Graph object at 0x107fe29a0>, 3, {'name': Node('Person', community=4, name='陳國慈', pagerank=1.2507701764504113e-05, person_id='94417b1d3d9bec10492592510c3e3e40')}),\n igraph.Vertex(<igraph.Graph object at 0x107fe29a0>, 4, {'name': Node('Person', community=142, name='施振榮', pagerank=3.678393872986297e-05, person_id='33400d8a8fda6a599ca2d92166089417')}),\n igraph.Vertex(<igraph.Graph object at 0x107fe29a0>, 5, {'name': Node('Person', community=4, name='海英俊', pagerank=3.691528889481475e-05, person_id='6bcaa268b1b2ad70fc7a641edd421528')}),\n igraph.Vertex(<igraph.Graph object at 0x107fe29a0>, 6, {'name': Node('Person', community=4, name='彼得.邦菲', pagerank=1.2507701764504113e-05, person_id='f58593da0c0f6602ef06cbcd6195f986')})]\n"
     ]
    }
   ],
   "source": [
    "# GG有多少獨立董事\n",
    "query = '''\n",
    "MATCH (m:Stock{name:'台積電'})<-[:employ_of{jobs:'獨立董事'}]-(n:Person)\n",
    "RETURN n, count(distinct(n))\n",
    "'''\n",
    "ig = IGraph.TupleList(graph.run(query), weights=True)\n",
    "pprint([v for v in ig.vs])\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "output_type": "execute_result",
     "data": {
      "text/plain": [
       "[{'m': Node('Stock', code='6414', community=1, market='上市', name='樺漢', pagerank=0.0013175629953942904, stock_id='6414'),\n",
       "  'count(distinct(m))': 1},\n",
       " {'m': Node('Stock', code='6166', community=1, market='上市', name='凌華', pagerank=0.0007760575850724419, stock_id='6166'),\n",
       "  'count(distinct(m))': 1},\n",
       " {'m': Node('Stock', code='3231', community=1, market='上市', name='緯創', pagerank=0.0018983248139954655, stock_id='3231'),\n",
       "  'count(distinct(m))': 1},\n",
       " {'m': Node('Stock', code='2395', community=1, market='上市', name='研華', pagerank=0.0016824349952384166, stock_id='2395'),\n",
       "  'count(distinct(m))': 1},\n",
       " {'m': Node('Stock', code='2382', community=1, market='上市', name='廣達', pagerank=0.0020281190833126, stock_id='2382'),\n",
       "  'count(distinct(m))': 1},\n",
       " {'m': Node('Stock', code='2377', community=1, market='上市', name='微星', pagerank=0.0011546411326951516, stock_id='2377'),\n",
       "  'count(distinct(m))': 1},\n",
       " {'m': Node('Stock', code='2357', community=1, market='上市', name='華碩', pagerank=0.0019591473665051926, stock_id='2357'),\n",
       "  'count(distinct(m))': 1},\n",
       " {'m': Node('Stock', code='2356', community=1, market='上市', name='英業達', pagerank=0.001723078095711191, stock_id='2356'),\n",
       "  'count(distinct(m))': 1},\n",
       " {'m': Node('Stock', code='2353', community=1, market='上市', name='宏碁', pagerank=0.0016508499173578585, stock_id='2353'),\n",
       "  'count(distinct(m))': 1}]"
      ]
     },
     "metadata": {},
     "execution_count": 7
    }
   ],
   "source": [
    "# 有多少'電腦及週邊設備業'也是'AI概念股'\n",
    "query = '''\n",
    "MATCH (:Concept{name:'AI人工智慧'})<-[:concept_of]-(m:Stock)-[:industry_of]->(:Industry{name:'電腦及週邊設備業'})\n",
    "RETURN m, count(distinct(m))\n",
    "'''\n",
    "graph.run(query).data()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "output_type": "execute_result",
     "data": {
      "text/plain": [
       "[{'p1': Node('Person', community=4, name='劉平貴', pagerank=1.208430226090359e-05, person_id='9b56a43be3f126da334b781d63da53bb'),\n",
       "  'count(distinct(p1))': 1},\n",
       " {'p1': Node('Person', community=4, name='詹鵬弘', pagerank=1.208430226090359e-05, person_id='124bc059485cb56ce5d3067dc03a6e6f'),\n",
       "  'count(distinct(p1))': 1},\n",
       " {'p1': Node('Person', community=4, name='溫志偉', pagerank=1.208430226090359e-05, person_id='e706756e2d1a336602b2e891279af81e'),\n",
       "  'count(distinct(p1))': 1},\n",
       " {'p1': Node('Person', community=4, name='陳禧冠', pagerank=1.208430226090359e-05, person_id='08881ed4de0d4e8a9f92584f1db92f1e'),\n",
       "  'count(distinct(p1))': 1},\n",
       " {'p1': Node('Person', community=4, name='譚仲興', pagerank=1.208430226090359e-05, person_id='3cc7b5fa5551f097f639929c06732ccf'),\n",
       "  'count(distinct(p1))': 1},\n",
       " {'p1': Node('Person', community=944, name='魏秋瑞', pagerank=2.0598120172635906e-05, person_id='d89eb6aa1f27216e95679b70773f69df'),\n",
       "  'count(distinct(p1))': 1},\n",
       " {'p1': Node('Person', community=245, name='許振昌', pagerank=2.0744230980964424e-05, person_id='c08d88765a2de2363e4ef38802071926'),\n",
       "  'count(distinct(p1))': 1},\n",
       " {'p1': Node('Person', community=4, name='張永南', pagerank=1.208430226090359e-05, person_id='8741d5d4928130058cf0cc1e08c70fc7'),\n",
       "  'count(distinct(p1))': 1},\n",
       " {'p1': Node('Person', community=4, name='徐睿鈞', pagerank=1.208430226090359e-05, person_id='54f137598102a1e321082564ba280b85'),\n",
       "  'count(distinct(p1))': 1},\n",
       " {'p1': Node('Person', community=4, name='丁長捷', pagerank=1.208430226090359e-05, person_id='0ff517a84f9f9804684e892db01acc5f'),\n",
       "  'count(distinct(p1))': 1}]"
      ]
     },
     "metadata": {},
     "execution_count": 8
    }
   ],
   "source": [
    "# 列出仁寶所有零持股的副總\n",
    "query = '''\n",
    "MATCH (:Stock{name:'仁寶'})<-[:employ_of{jobs:'副總', stock_num:0}]-(p1:Person)\n",
    "RETURN p1, count(distinct(p1))\n",
    "'''\n",
    "graph.run(query).data()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "output_type": "execute_result",
     "data": {
      "text/plain": [
       "[{'min': 0, 'max': 7487, 'avg_characters': 594.4, 'stdev': 1347.043586351018}]"
      ]
     },
     "metadata": {},
     "execution_count": 9
    }
   ],
   "source": [
    "# 列出仁寶副總所有持股的統計\n",
    "query = '''\n",
    "MATCH (:Stock{name:'仁寶'})<-[emp:employ_of{jobs:'副總'}]-(p1:Person)\n",
    "WITH emp.stock_num AS num\n",
    "RETURN min(num) AS min, max(num) AS max, avg(num) AS avg_characters, stdev(num) AS stdev\n",
    "'''\n",
    "graph.run(query).data()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "output_type": "execute_result",
     "data": {
      "text/plain": [
       "              ratio \n",
       "--------------------\n",
       " 0.2857142857142857 "
      ]
     },
     "metadata": {},
     "execution_count": 10
    }
   ],
   "source": [
    "# 仁寶副總有多少比例零持股\n",
    "query = '''\n",
    "MATCH (:Stock{name:'仁寶'})<-[:employ_of{jobs:'副總', stock_num:0}]-(p1:Person)\n",
    "MATCH (:Stock{name:'仁寶'})<-[:employ_of{jobs:'副總'}]-(p2:Person)\n",
    "RETURN count(distinct(p1))*1.0/ count(distinct(p2)) as ratio\n",
    "'''\n",
    "graph.run(query)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "output_type": "execute_result",
     "data": {
      "text/plain": [
       "              ratio \n",
       "--------------------\n",
       " 0.8857142857142857 "
      ]
     },
     "metadata": {},
     "execution_count": 11
    }
   ],
   "source": [
    "# 仁寶副總有多少比例持股小於1000\n",
    "query = '''\n",
    "MATCH (:Stock{name:'仁寶'})<-[emp:employ_of{jobs:'副總'}]-(p1:Person)\n",
    "MATCH (:Stock{name:'仁寶'})<-[:employ_of{jobs:'副總'}]-(p2:Person)\n",
    "WHERE emp.stock_num < 1000\n",
    "RETURN count(distinct(p1))*1.0/ count(distinct(p2)) as ratio\n",
    "'''\n",
    "graph.run(query)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [],
   "source": [
    "# # Shortest path\n",
    "# query = '''\n",
    "# MATCH (s1:Stock{code:'2330'}), (s2:Stock) WHERE s1.code <> s2.code\n",
    "# MATCH p=shortestPath((s1)-[*]-(s2))\n",
    "# WITH p\n",
    "# WHERE length(p)<5\n",
    "# RETURN length(p) AS len, [x IN nodes(p) | x.name] AS path\n",
    "# ORDER BY len DESC LIMIT 10\n",
    "# '''\n",
    "\n",
    "# graph.run(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "output_type": "execute_result",
     "data": {
      "text/plain": [
       "[{'concept': ['4G LTE']},\n",
       " {'concept': ['5G']},\n",
       " {'concept': ['iTV']},\n",
       " {'concept': ['車聯網']},\n",
       " {'concept': ['車用電子相關']},\n",
       " {'concept': ['AI人工智慧']},\n",
       " {'concept': ['網通']},\n",
       " {'concept': ['3D感測']},\n",
       " {'concept': ['華為']},\n",
       " {'concept': ['山寨機']},\n",
       " {'concept': ['3D技術']},\n",
       " {'concept': ['手機']},\n",
       " {'concept': ['APPLE概念']}]"
      ]
     },
     "metadata": {},
     "execution_count": 13
    }
   ],
   "source": [
    "# GG跟發哥在概念股上的最短路徑\n",
    "query = '''\n",
    "MATCH (a:Stock {code:'2330'}), (b:Stock {code:'2454'})\n",
    "MATCH p=allShortestPaths((a)-[:concept_of*]-(b))\n",
    "WITH [node IN nodes(p) where node:Concept | node.name] AS concept\n",
    "RETURN concept \n",
    "'''\n",
    "graph.run(query).data()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [
    {
     "output_type": "execute_result",
     "data": {
      "text/plain": [
       "[{'stock': '彰銀', 'degree': 240},\n",
       " {'stock': '臺企銀', 'degree': 198},\n",
       " {'stock': '安泰銀', 'degree': 169},\n",
       " {'stock': '開發金', 'degree': 152},\n",
       " {'stock': '聯邦銀', 'degree': 151},\n",
       " {'stock': '遠東銀', 'degree': 150},\n",
       " {'stock': '凌群', 'degree': 143},\n",
       " {'stock': '上海商銀', 'degree': 136},\n",
       " {'stock': '台中銀', 'degree': 135},\n",
       " {'stock': '中華電', 'degree': 134}]"
      ]
     },
     "metadata": {},
     "execution_count": 14
    }
   ],
   "source": [
    "# 查詢含有最多degree(不考慮方向以及關聯類別)的前10個Stock\n",
    "# 彰銀主要靠董事成員夠多\n",
    "query = '''\n",
    "MATCH (s:Stock)\n",
    "RETURN s.name AS stock, size( (s)-[]-() ) AS degree \n",
    "ORDER BY degree DESC LIMIT 10\n",
    "'''\n",
    "\n",
    "graph.run(query).data()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [
    {
     "output_type": "execute_result",
     "data": {
      "text/plain": [
       "[{'person': '大通先進星光', 'degree': 194},\n",
       " {'person': '富邦人壽保險(股)', 'degree': 193},\n",
       " {'person': '花旗託管挪威', 'degree': 158},\n",
       " {'person': '國泰人壽保險(股)', 'degree': 103},\n",
       " {'person': '摩根梵市場股', 'degree': 88},\n",
       " {'person': '勞工局全權', 'degree': 85},\n",
       " {'person': '南山人壽保險(股)', 'degree': 50},\n",
       " {'person': '匯豐摩根士丹', 'degree': 47},\n",
       " {'person': '台灣人壽保險(股)', 'degree': 47},\n",
       " {'person': '全球人壽保險(股)', 'degree': 37},\n",
       " {'person': '花旗台DFA 核', 'degree': 36},\n",
       " {'person': '花旗次元新興', 'degree': 34},\n",
       " {'person': '公務人員退休', 'degree': 29},\n",
       " {'person': '三商美邦人壽(股)', 'degree': 28},\n",
       " {'person': '花旗(台灣)託', 'degree': 26},\n",
       " {'person': '舊制勞工退休', 'degree': 26},\n",
       " {'person': '中華郵政(股)', 'degree': 24},\n",
       " {'person': '新制勞工退休', 'degree': 23},\n",
       " {'person': '美商摩根-004', 'degree': 22},\n",
       " {'person': '中國信託商業', 'degree': 21},\n",
       " {'person': '新光人壽保險(股)', 'degree': 21},\n",
       " {'person': '兆豐國際商業(股)', 'degree': 19},\n",
       " {'person': '花旗台新加坡', 'degree': 18},\n",
       " {'person': '中國人壽保險(股)', 'degree': 18},\n",
       " {'person': '渣打託管列支', 'degree': 17},\n",
       " {'person': '花旗政府(星)', 'degree': 17},\n",
       " {'person': '大通託管梵加', 'degree': 16},\n",
       " {'person': '摩根託管梵加', 'degree': 16},\n",
       " {'person': '群益金鼎證券', 'degree': 15},\n",
       " {'person': '渣打國際商業', 'degree': 15},\n",
       " {'person': '元大台灣高股', 'degree': 14},\n",
       " {'person': '渣打瑞信文藝', 'degree': 14},\n",
       " {'person': '涂水城', 'degree': 14},\n",
       " {'person': '遠雄人壽保險(股)', 'degree': 13},\n",
       " {'person': '渣打託管歐洲', 'degree': 12}]"
      ]
     },
     "metadata": {},
     "execution_count": 15
    }
   ],
   "source": [
    "# 查詢跟最多股票有關係的前35位董事\n",
    "# 涂水城是大股東\n",
    "query = '''\n",
    "MATCH (p:Person)\n",
    "RETURN p.name AS person, size( (p)-[]-(:Stock) ) AS degree \n",
    "ORDER BY degree DESC LIMIT 35\n",
    "'''\n",
    "\n",
    "graph.run(query).data()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "output_type": "execute_result",
     "data": {
      "text/plain": [
       "[{'person': '富邦人壽保險(股)', 'stockNum': 6021145},\n",
       " {'person': '花旗台積存託', 'stockNum': 5325610},\n",
       " {'person': '大通先進星光', 'stockNum': 5174727},\n",
       " {'person': '經濟部(股)-劉明忠', 'stockNum': 3486011},\n",
       " {'person': '財政部-江瑞堂', 'stockNum': 3475465},\n",
       " {'person': '財政部-許國郎', 'stockNum': 3475465},\n",
       " {'person': '財政部-陳美足', 'stockNum': 3475465},\n",
       " {'person': '財政部-雷仲達', 'stockNum': 3475465},\n",
       " {'person': '財政部-施遵驊', 'stockNum': 3475465},\n",
       " {'person': '財政部-李新仁', 'stockNum': 3475465},\n",
       " {'person': '勞工局全權', 'stockNum': 3421359},\n",
       " {'person': '台灣化學纖維(股)-王文淵', 'stockNum': 3417801},\n",
       " {'person': '花旗託管挪威', 'stockNum': 3375861},\n",
       " {'person': '長庚醫療財團', 'stockNum': 3257043},\n",
       " {'person': '經濟部(股)-曾文生', 'stockNum': 3154709},\n",
       " {'person': '經濟部(股)-翁朝棟', 'stockNum': 3154709},\n",
       " {'person': '國泰人壽保險(股)', 'stockNum': 2872015},\n",
       " {'person': '交通部-張信一', 'stockNum': 2737719},\n",
       " {'person': '交通部-蕭宏宜', 'stockNum': 2737719},\n",
       " {'person': '交通部-黃玉霖', 'stockNum': 2737719},\n",
       " {'person': '交通部-謝繼茂', 'stockNum': 2737719},\n",
       " {'person': '交通部-郭水義', 'stockNum': 2737719},\n",
       " {'person': '交通部-李連權', 'stockNum': 2737719},\n",
       " {'person': '交通部-潘進財', 'stockNum': 2737719},\n",
       " {'person': '交通部-陳信宏', 'stockNum': 2737719},\n",
       " {'person': '臺灣銀行(股)-王昭文', 'stockNum': 2729230},\n",
       " {'person': '臺灣銀行(股)-王安邦', 'stockNum': 2729230},\n",
       " {'person': '臺灣銀行(股)-蔡偉德', 'stockNum': 2729230},\n",
       " {'person': '臺灣銀行(股)-顏佑銘', 'stockNum': 2729230},\n",
       " {'person': '臺灣銀行(股)-鄭士卿', 'stockNum': 2729230},\n",
       " {'person': '臺灣銀行(股)-陳和全', 'stockNum': 2729230},\n",
       " {'person': '台灣塑膠工業(股)-王瑞華', 'stockNum': 2720549},\n",
       " {'person': '台灣塑膠工業(股)-陳寶郎', 'stockNum': 2720549},\n",
       " {'person': '花旗台新加坡', 'stockNum': 2603725},\n",
       " {'person': '萬寶開發(股)', 'stockNum': 2574832}]"
      ]
     },
     "metadata": {},
     "execution_count": 16
    }
   ],
   "source": [
    "# 查詢總持股前35最多的董事\n",
    "query = '''\n",
    "MATCH (p:Person)-[r:employ_of]-(:Stock)\n",
    "RETURN p.name AS person, sum(r.stock_num) as stockNum\n",
    "ORDER BY stockNum DESC LIMIT 35\n",
    "'''\n",
    "\n",
    "graph.run(query).data()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [],
   "source": [
    "# query = '''CALL gds.graph.drop('myGraph', false) '''\n",
    "# query = '''\n",
    "# CALL gds.graph.create('myGraph', 'Person', 'employ_of') YIELD graphName\n",
    "# CALL gds.betweenness.stream('myGraph')\n",
    "# YIELD nodeId, score\n",
    "# RETURN gds.util.asNode(nodeId).name AS name, score\n",
    "# ORDER BY score DESC\n",
    "# '''\n",
    "\n",
    "# graph.run(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [
    {
     "output_type": "stream",
     "name": "stdout",
     "text": [
      "CPU times: user 778 ms, sys: 9.4 ms, total: 787 ms\nWall time: 13.2 s\n"
     ]
    },
    {
     "output_type": "execute_result",
     "data": {
      "text/plain": [
       "[{'name': '鴻海', 'pagerank': 0.0045964934531273335},\n",
       " {'name': '台達電', 'pagerank': 0.004310181320021675},\n",
       " {'name': '三星', 'pagerank': 0.003483259001461227},\n",
       " {'name': '宏達電', 'pagerank': 0.003446341125224638},\n",
       " {'name': '台積電', 'pagerank': 0.0027551025841649575},\n",
       " {'name': '瑞昱', 'pagerank': 0.0025400787658382616},\n",
       " {'name': '聯發科', 'pagerank': 0.002481455936974289},\n",
       " {'name': '正崴', 'pagerank': 0.0023928584477215862},\n",
       " {'name': '大立光', 'pagerank': 0.0022379246476795377},\n",
       " {'name': '鴻準', 'pagerank': 0.002173595166571676},\n",
       " {'name': '日月光投控', 'pagerank': 0.002148131312296115},\n",
       " {'name': '廣達', 'pagerank': 0.0020281190833126},\n",
       " {'name': '原相', 'pagerank': 0.001971843639240618},\n",
       " {'name': '仁寶', 'pagerank': 0.0019641993070372674},\n",
       " {'name': '華碩', 'pagerank': 0.0019591473665051926},\n",
       " {'name': '群創', 'pagerank': 0.0019250705015212903},\n",
       " {'name': '緯創', 'pagerank': 0.0018983248139954655},\n",
       " {'name': 'TPK-KY', 'pagerank': 0.0018568000367802826},\n",
       " {'name': '東元', 'pagerank': 0.0018564483536960906},\n",
       " {'name': '偉詮電', 'pagerank': 0.001834549862129348}]"
      ]
     },
     "metadata": {},
     "execution_count": 18
    }
   ],
   "source": [
    "%%time\n",
    "# PageRank: The size of each node is proportional to the number and size of the other nodes pointing to it in the network. \n",
    "# 使用pagerank篩選在所有概念股類別當中，參與這些概念股前20多的股票\n",
    "query = '''\n",
    "MATCH (s:Stock)-[r:concept_of]->(c:Concept)\n",
    "RETURN s.name, c.name\n",
    "'''\n",
    "ig = IGraph.TupleList(graph.run(query), weights=True)\n",
    "\n",
    "pg = ig.pagerank()\n",
    "pgvs = []\n",
    "for p in zip(ig.vs, pg):\n",
    "    pgvs.append({\"name\": p[0][\"name\"], \"pg\": p[1]})\n",
    "\n",
    "write_clusters_query = '''\n",
    "UNWIND $nodes AS n\n",
    "MATCH (s:Stock) WHERE s.name = n.name\n",
    "SET s.pagerank = n.pg\n",
    "'''\n",
    "graph.run(write_clusters_query, nodes=pgvs)\n",
    "\n",
    "\n",
    "query = '''\n",
    "MATCH (s:Stock)--(st:StockType{name:'股票'})\n",
    "WHERE s.pagerank<>'none'\n",
    "RETURN s.name AS name, s.pagerank AS pagerank ORDER BY pagerank DESC LIMIT 20\n",
    "'''\n",
    "graph.run(query).data()"
   ]
  },
  {
   "source": [
    "%%time\n",
    "# 使用各檔股票的概念股來做各檔股票的community detection\n",
    "\n",
    "clusters = IGraph.community_walktrap(ig, steps=3).as_clustering()\n",
    "\n",
    "nodes = [{\"name\": node[\"name\"]} for node in ig.vs]\n",
    "for node in nodes:\n",
    "    idx = ig.vs.find(name=node[\"name\"]).index\n",
    "    node[\"community\"] = clusters.membership[idx]\n",
    "\n",
    "write_clusters_query = '''\n",
    "UNWIND $nodes AS n\n",
    "MATCH (s:Stock) WHERE s.name = n.name\n",
    "SET s.community = toInteger(n.community)\n",
    "'''\n",
    "\n",
    "graph.run(write_clusters_query, nodes=nodes)\n",
    "\n",
    "query = '''\n",
    "MATCH (s:Stock)\n",
    "WITH s.community AS cluster, collect(s.name) AS members\n",
    "WHERE cluster<>'none'\n",
    "RETURN cluster, members ORDER BY cluster ASC\n",
    "'''\n",
    "\n",
    "graph.run(query).data()[:3]\n"
   ],
   "cell_type": "code",
   "metadata": {
    "tags": []
   },
   "execution_count": 19,
   "outputs": [
    {
     "output_type": "stream",
     "name": "stdout",
     "text": [
      "CPU times: user 57.1 ms, sys: 3.04 ms, total: 60.2 ms\nWall time: 11.4 s\n"
     ]
    },
    {
     "output_type": "execute_result",
     "data": {
      "text/plain": [
       "[{'cluster': 0,\n",
       "  'members': ['捷迅',\n",
       "   '網龍',\n",
       "   '華義',\n",
       "   '艾訊',\n",
       "   '新洲',\n",
       "   '鈊象',\n",
       "   '宇峻',\n",
       "   '歐買尬',\n",
       "   '辣椒',\n",
       "   '數字',\n",
       "   '智冠',\n",
       "   '中菲行',\n",
       "   '大宇資',\n",
       "   '昱泉',\n",
       "   '橘子',\n",
       "   '網家',\n",
       "   '廣積',\n",
       "   '伍豐',\n",
       "   '友通',\n",
       "   '敦陽科',\n",
       "   '東森',\n",
       "   '台驊投控',\n",
       "   '宅配通',\n",
       "   '晶華',\n",
       "   '玉山金',\n",
       "   '永豐金',\n",
       "   '威強電',\n",
       "   '喬鼎',\n",
       "   '晟鈦',\n",
       "   '事欣科',\n",
       "   '聚碩',\n",
       "   '關貿',\n",
       "   '富邦媒']},\n",
       " {'cluster': 1,\n",
       "  'members': ['協禧',\n",
       "   '僑威',\n",
       "   '聯亞',\n",
       "   '穩懋',\n",
       "   '新揚科',\n",
       "   '璟德',\n",
       "   '波若威',\n",
       "   '亞信',\n",
       "   '樺晟',\n",
       "   '順達',\n",
       "   '原相',\n",
       "   '金麗科',\n",
       "   '光環',\n",
       "   '鑫創',\n",
       "   '威剛',\n",
       "   '台星科',\n",
       "   '宇環',\n",
       "   '微端',\n",
       "   '尼克森',\n",
       "   '建舜電',\n",
       "   '雙鴻',\n",
       "   '尚立',\n",
       "   '上詮',\n",
       "   '精材',\n",
       "   '崇越電',\n",
       "   '旭軟',\n",
       "   '致振',\n",
       "   '力致',\n",
       "   '昇達科',\n",
       "   '位速',\n",
       "   '矽瑪',\n",
       "   '鴻翊',\n",
       "   '聚積',\n",
       "   '力旺',\n",
       "   '兆利',\n",
       "   '禾瑞亞',\n",
       "   '神準',\n",
       "   '磐儀',\n",
       "   '鼎翰',\n",
       "   '安可',\n",
       "   '富晶通',\n",
       "   '新鉅科',\n",
       "   '艾恩特',\n",
       "   '精聯',\n",
       "   '湧德',\n",
       "   '營邦',\n",
       "   '漢磊',\n",
       "   '台微體',\n",
       "   '鐿鈦',\n",
       "   '永捷',\n",
       "   '熒茂',\n",
       "   '聯光通',\n",
       "   '前鼎',\n",
       "   '新復興',\n",
       "   '友輝',\n",
       "   '亞電',\n",
       "   'IET-KY',\n",
       "   '廣穎',\n",
       "   '華星光',\n",
       "   '環宇-KY',\n",
       "   '智晶',\n",
       "   '笙科',\n",
       "   '信驊',\n",
       "   '世界',\n",
       "   '鈺創',\n",
       "   '台林',\n",
       "   '協益',\n",
       "   '中光電',\n",
       "   '宣德',\n",
       "   '通泰',\n",
       "   '松普',\n",
       "   '同亨',\n",
       "   '創惟',\n",
       "   '新普',\n",
       "   '上奇',\n",
       "   '信音',\n",
       "   '萬旭',\n",
       "   '茂達',\n",
       "   '耕興',\n",
       "   '頎邦',\n",
       "   '撼訊',\n",
       "   '欣技',\n",
       "   '華電網',\n",
       "   '久正',\n",
       "   '亞通',\n",
       "   '幃翔',\n",
       "   '萬潤',\n",
       "   '廣明',\n",
       "   '旺玖',\n",
       "   '驊訊',\n",
       "   '立端',\n",
       "   '久元',\n",
       "   '普萊德',\n",
       "   '台燿',\n",
       "   '良維',\n",
       "   '沛亨',\n",
       "   '晶焱',\n",
       "   '統新',\n",
       "   '神盾',\n",
       "   '宇智',\n",
       "   '互動',\n",
       "   '東典光電',\n",
       "   '展匯科',\n",
       "   '鈺太',\n",
       "   '光菱',\n",
       "   '榮群',\n",
       "   '九暘',\n",
       "   '晶采',\n",
       "   '安國',\n",
       "   '元太',\n",
       "   '宏捷科',\n",
       "   '擎亞',\n",
       "   '天宇',\n",
       "   '加高',\n",
       "   '新漢',\n",
       "   '華宏',\n",
       "   '泰藝',\n",
       "   '群聯',\n",
       "   '東元',\n",
       "   '信錦',\n",
       "   '聲寶',\n",
       "   '華榮',\n",
       "   '三洋電',\n",
       "   '川湖',\n",
       "   '光寶科',\n",
       "   '聯電',\n",
       "   '華通',\n",
       "   '台揚',\n",
       "   '中環',\n",
       "   '仁寶',\n",
       "   '廣宇',\n",
       "   '台積電',\n",
       "   '精英',\n",
       "   '友訊',\n",
       "   '旺宏',\n",
       "   '智邦',\n",
       "   '錸德',\n",
       "   '宏碁',\n",
       "   '鴻準',\n",
       "   '英業達',\n",
       "   '華碩',\n",
       "   '致茂',\n",
       "   '矽統',\n",
       "   '昆盈',\n",
       "   '燿華',\n",
       "   '金像電',\n",
       "   '菱生',\n",
       "   '技嘉',\n",
       "   '微星',\n",
       "   '廣達',\n",
       "   '台光電',\n",
       "   '群光',\n",
       "   '精元',\n",
       "   '威盛',\n",
       "   '正崴',\n",
       "   '億光',\n",
       "   '研華',\n",
       "   '浩鑫',\n",
       "   '南亞科',\n",
       "   '友達',\n",
       "   '中華電',\n",
       "   '環科',\n",
       "   '精技',\n",
       "   '仲琦',\n",
       "   '新巨',\n",
       "   '燦坤',\n",
       "   '聯昌',\n",
       "   '偉詮電',\n",
       "   '美律',\n",
       "   '兆勁',\n",
       "   '京元電子',\n",
       "   '神腦',\n",
       "   '創見',\n",
       "   '凌群',\n",
       "   '聯發科',\n",
       "   '全新',\n",
       "   '奇力新',\n",
       "   '飛宏',\n",
       "   '義隆',\n",
       "   '光群雷',\n",
       "   '麗臺',\n",
       "   '華經',\n",
       "   '資通',\n",
       "   '可成',\n",
       "   '鉅祥',\n",
       "   '連宇',\n",
       "   '兆赫',\n",
       "   '瑞軒',\n",
       "   '普安',\n",
       "   '宏達電',\n",
       "   '台新金',\n",
       "   '晶豪科',\n",
       "   '大立光',\n",
       "   '晟銘電',\n",
       "   '聯陽',\n",
       "   '全漢',\n",
       "   '奇鋐',\n",
       "   '零壹',\n",
       "   '聯詠',\n",
       "   '智原',\n",
       "   '欣興',\n",
       "   '全台',\n",
       "   '揚智',\n",
       "   '晶技',\n",
       "   '科風',\n",
       "   '健鼎',\n",
       "   '台灣大',\n",
       "   '和鑫',\n",
       "   '鈺德',\n",
       "   '力特',\n",
       "   '立德',\n",
       "   '銘異',\n",
       "   '建漢',\n",
       "   '聯傑',\n",
       "   '耀登',\n",
       "   '正達',\n",
       "   '景碩',\n",
       "   '全科',\n",
       "   '緯創',\n",
       "   '虹冠電',\n",
       "   '閎暉',\n",
       "   '同泰',\n",
       "   '泰碩',\n",
       "   '新日興',\n",
       "   '明泰',\n",
       "   '玉晶光',\n",
       "   '融程電',\n",
       "   '譁裕',\n",
       "   '榮創',\n",
       "   '創意',\n",
       "   '聯鈞',\n",
       "   '晶彩科',\n",
       "   '敦泰',\n",
       "   '聯穎',\n",
       "   '力銘',\n",
       "   '智易',\n",
       "   '谷崧',\n",
       "   '洋華',\n",
       "   '達邁',\n",
       "   '健策',\n",
       "   'TPK-KY',\n",
       "   '亞太電',\n",
       "   '海華',\n",
       "   '大聯大',\n",
       "   '合勤控',\n",
       "   '日月光投控',\n",
       "   '遠傳',\n",
       "   '正文',\n",
       "   '致伸',\n",
       "   '新唐',\n",
       "   '泰鼎-KY',\n",
       "   '和碩',\n",
       "   '嘉彰',\n",
       "   '凌通',\n",
       "   '臻鼎-KY',\n",
       "   '誠美材',\n",
       "   '立積',\n",
       "   '眾達-KY',\n",
       "   '三星',\n",
       "   '訊連',\n",
       "   '達興材料',\n",
       "   '中磊',\n",
       "   '松翰',\n",
       "   '達運',\n",
       "   '柏承',\n",
       "   '友勁',\n",
       "   '百一',\n",
       "   '嘉聯益',\n",
       "   '鈞寶',\n",
       "   '凌華',\n",
       "   '宏齊',\n",
       "   '瑞儀',\n",
       "   '大豐電',\n",
       "   '盛群',\n",
       "   '飛捷',\n",
       "   '今國光',\n",
       "   '聯茂',\n",
       "   '精誠',\n",
       "   '超眾',\n",
       "   '力成',\n",
       "   '迅杰',\n",
       "   '定穎',\n",
       "   '矽格',\n",
       "   '台郡',\n",
       "   '同欣電',\n",
       "   '台表科',\n",
       "   '康舒',\n",
       "   '啟碁',\n",
       "   '群電',\n",
       "   '樺漢',\n",
       "   '瑞祺電通',\n",
       "   '光聖',\n",
       "   '訊芯-KY',\n",
       "   'GIS-KY',\n",
       "   '晶心科',\n",
       "   '研揚',\n",
       "   '緯穎',\n",
       "   '鋐寶科技',\n",
       "   '惠特',\n",
       "   '台通',\n",
       "   '矽創',\n",
       "   '南電',\n",
       "   '致新',\n",
       "   '華冠',\n",
       "   '瀚荃',\n",
       "   '錸寶',\n",
       "   '凌巨',\n",
       "   '至上',\n",
       "   '振樺電',\n",
       "   '南茂',\n",
       "   '達方',\n",
       "   '勤誠',\n",
       "   '志超',\n",
       "   '明基材',\n",
       "   '中視',\n",
       "   '晨訊科-DR']},\n",
       " {'cluster': 2,\n",
       "  'members': ['和勤',\n",
       "   '世德',\n",
       "   '公準',\n",
       "   '茂訊',\n",
       "   '台嘉碩',\n",
       "   '千如',\n",
       "   '欣銓',\n",
       "   '鼎天',\n",
       "   '加百裕',\n",
       "   '先進光',\n",
       "   '崧騰',\n",
       "   '長盛',\n",
       "   '環天科',\n",
       "   '凡甲',\n",
       "   '同致',\n",
       "   '西勝',\n",
       "   '德微',\n",
       "   '江興鍛',\n",
       "   '淳紳',\n",
       "   '晟田',\n",
       "   '美琪瑪',\n",
       "   '新盛力',\n",
       "   '亞泰',\n",
       "   '立凱-KY',\n",
       "   '宜鼎',\n",
       "   '應華',\n",
       "   '台半',\n",
       "   '高技',\n",
       "   '普誠',\n",
       "   '統振',\n",
       "   '中探針',\n",
       "   '元山',\n",
       "   '胡連',\n",
       "   '佳邦',\n",
       "   '廣錠',\n",
       "   '威潤',\n",
       "   '聚和',\n",
       "   '富致',\n",
       "   'M31',\n",
       "   '長園科',\n",
       "   '精星',\n",
       "   '朋程',\n",
       "   '金居',\n",
       "   '永裕',\n",
       "   '堤維西',\n",
       "   '江申',\n",
       "   '車王電',\n",
       "   '和大',\n",
       "   '倉佑',\n",
       "   '中電',\n",
       "   '中碳',\n",
       "   '國際中橡',\n",
       "   '裕隆',\n",
       "   '劍麟',\n",
       "   '為升',\n",
       "   '艾姆勒',\n",
       "   '台達電',\n",
       "   '金寶',\n",
       "   '楠梓電',\n",
       "   '鴻海',\n",
       "   '國巨',\n",
       "   '光磊',\n",
       "   '華邦電',\n",
       "   '順德',\n",
       "   '敬鵬',\n",
       "   '瑞昱',\n",
       "   '凌陽',\n",
       "   '建準',\n",
       "   '興勤',\n",
       "   '建通',\n",
       "   '立隆電',\n",
       "   '美隆電',\n",
       "   '強茂',\n",
       "   '希華',\n",
       "   '華新科',\n",
       "   '怡利電',\n",
       "   '漢翔',\n",
       "   '健和興',\n",
       "   '亞光',\n",
       "   '鴻名',\n",
       "   '信邦',\n",
       "   '禾伸堂',\n",
       "   '文曄',\n",
       "   '益登',\n",
       "   '華晶科',\n",
       "   '日電貿',\n",
       "   '麗清',\n",
       "   '群創',\n",
       "   '維熹',\n",
       "   '晶相光',\n",
       "   '宏致',\n",
       "   '貿聯-KY',\n",
       "   '神達',\n",
       "   '拓凱',\n",
       "   '康普',\n",
       "   '佳凌',\n",
       "   '界霖',\n",
       "   '競國',\n",
       "   '精成科',\n",
       "   '詮欣',\n",
       "   '聚鼎',\n",
       "   '華孚',\n",
       "   '聯嘉',\n",
       "   '興能高',\n",
       "   '帝寶',\n",
       "   '昇陽半導體',\n",
       "   '雷虎',\n",
       "   '華東',\n",
       "   '福懋科',\n",
       "   '富鼎']}]"
      ]
     },
     "metadata": {},
     "execution_count": 19
    }
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [
    {
     "output_type": "stream",
     "name": "stdout",
     "text": [
      "CPU times: user 8.92 s, sys: 74.4 ms, total: 8.99 s\nWall time: 11min 25s\n"
     ]
    },
    {
     "output_type": "execute_result",
     "data": {
      "text/plain": [
       "[{'name': '富邦人壽保險(股)', 'pagerank': 0.0016337940285416409},\n",
       " {'name': '大通先進星光', 'pagerank': 0.0015896539158322487},\n",
       " {'name': '花旗託管挪威', 'pagerank': 0.001319890704584411},\n",
       " {'name': '國泰人壽保險(股)', 'pagerank': 0.0008544437127366045},\n",
       " {'name': '摩根梵市場股', 'pagerank': 0.0007249435924771437},\n",
       " {'name': '勞工局全權', 'pagerank': 0.0006965305696453782},\n",
       " {'name': '南山人壽保險(股)', 'pagerank': 0.00041250698393963673},\n",
       " {'name': '匯豐摩根士丹', 'pagerank': 0.0004069461479897839},\n",
       " {'name': '台灣人壽保險(股)', 'pagerank': 0.0003977390481770738},\n",
       " {'name': '全球人壽保險(股)', 'pagerank': 0.0003104576847542618},\n",
       " {'name': '花旗台DFA 核', 'pagerank': 0.00030774778896447305},\n",
       " {'name': '花旗次元新興', 'pagerank': 0.0002851744153518003},\n",
       " {'name': '公務人員退休', 'pagerank': 0.00023828747760839845},\n",
       " {'name': '三商美邦人壽(股)', 'pagerank': 0.00023671636148385588},\n",
       " {'name': '花旗(台灣)託', 'pagerank': 0.00021701151660540204},\n",
       " {'name': '舊制勞工退休', 'pagerank': 0.0002084911336964447},\n",
       " {'name': '中華郵政(股)', 'pagerank': 0.0002073511959648976},\n",
       " {'name': '美商摩根-004', 'pagerank': 0.00018996375019481986},\n",
       " {'name': '中國信託商業', 'pagerank': 0.0001881603139621324},\n",
       " {'name': '新光人壽保險(股)', 'pagerank': 0.00018690703238133618}]"
      ]
     },
     "metadata": {},
     "execution_count": 20
    }
   ],
   "source": [
    "%%time\n",
    "# 使用pagerank篩選在所有股票當中，參與這些股票前20多的董事\n",
    "\n",
    "query = '''\n",
    "MATCH (p:Person)-[r:employ_of]->(s:Stock)\n",
    "RETURN p.name, s.name\n",
    "'''\n",
    "ig = IGraph.TupleList(graph.run(query), weights=True)\n",
    "\n",
    "pg = ig.pagerank()\n",
    "pgvs = []\n",
    "for p in zip(ig.vs, pg):\n",
    "    pgvs.append({\"name\": p[0][\"name\"], \"pg\": p[1]})\n",
    "\n",
    "write_clusters_query = '''\n",
    "UNWIND $nodes AS n\n",
    "MATCH (p:Person) WHERE p.name = n.name\n",
    "SET p.pagerank = n.pg\n",
    "'''\n",
    "graph.run(write_clusters_query, nodes=pgvs)\n",
    "\n",
    "\n",
    "query = '''\n",
    "MATCH (p:Person)\n",
    "RETURN p.name AS name, p.pagerank AS pagerank ORDER BY pagerank DESC LIMIT 20\n",
    "'''\n",
    "graph.run(query).data()\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [
    {
     "output_type": "execute_result",
     "data": {
      "text/plain": [
       "37622"
      ]
     },
     "metadata": {},
     "execution_count": 21
    }
   ],
   "source": [
    "len(pgvs)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {},
   "outputs": [
    {
     "output_type": "stream",
     "name": "stdout",
     "text": [
      "CPU times: user 44.4 s, sys: 404 ms, total: 44.8 s\nWall time: 16min 50s\n"
     ]
    },
    {
     "output_type": "execute_result",
     "data": {
      "text/plain": [
       "[{'cluster': 0,\n",
       "  'members': ['李志弘',\n",
       "   '昇鋒投資(股)-吳新恙',\n",
       "   '許美鳳',\n",
       "   '周佳樺',\n",
       "   '李紹利',\n",
       "   '張智傑',\n",
       "   '林柏仰',\n",
       "   '陸醒華',\n",
       "   '許逸綸',\n",
       "   '三功國際(股)-許俊麒',\n",
       "   '精聚資訊股份(股)',\n",
       "   '吳星澄',\n",
       "   '黃識頻',\n",
       "   '農安生技(股)-鄭依佳',\n",
       "   '三功國際(股)-謝國棟',\n",
       "   '邵士軒',\n",
       "   '蕭裕峰',\n",
       "   '沈子文',\n",
       "   '葉文隆',\n",
       "   '洪碩嬪',\n",
       "   '洪堯智',\n",
       "   '王恒安',\n",
       "   '黃春生',\n",
       "   '興泰實業(股)',\n",
       "   '蔣玲玉',\n",
       "   '吳美紅',\n",
       "   '官耀(木丹)',\n",
       "   '林振錦',\n",
       "   '蕭明珠',\n",
       "   '許俊麒',\n",
       "   '翁仁培',\n",
       "   '林永振',\n",
       "   '黃釋慧',\n",
       "   '劉濤',\n",
       "   '三功國際(股)-黃春生',\n",
       "   '鄧雲棟',\n",
       "   '茂生農經(股)-黃強',\n",
       "   '許忠明',\n",
       "   '許逸群',\n",
       "   '魏恒巍',\n",
       "   '張振瑤',\n",
       "   '許逸揚',\n",
       "   '黃寶慧',\n",
       "   '王金銷',\n",
       "   '李季霖',\n",
       "   '古富政',\n",
       "   '農安生技(股)',\n",
       "   '劉紹蔚',\n",
       "   '葉姿伶',\n",
       "   '三功國際(股)-林曼麗',\n",
       "   '秦慧如',\n",
       "   '美安生化科技(股)',\n",
       "   '邱旭蘭',\n",
       "   '胡聯國',\n",
       "   '李欣然',\n",
       "   '葉雪玲',\n",
       "   '黃大中',\n",
       "   '許逸德',\n",
       "   '泰山元(股)-劉韋辰',\n",
       "   '李建儀',\n",
       "   '雷惠民',\n",
       "   '許守雄',\n",
       "   '黃緹瑩',\n",
       "   '吳星和',\n",
       "   '黃強',\n",
       "   '秦國強',\n",
       "   '蘇玲慧',\n",
       "   '李安宗',\n",
       "   '群盛發(股)',\n",
       "   '澄隆投資(股)-蕭明珠',\n",
       "   '楊俊賢',\n",
       "   '昇鋒投資(股)',\n",
       "   '華紹投資(股)-洪堯昆',\n",
       "   '精誠資訊(股)',\n",
       "   '孫士明',\n",
       "   '葉信宏',\n",
       "   '安達鑫投資(股)-黃識頻',\n",
       "   '華承投資(股)',\n",
       "   '陳月裡',\n",
       "   '韓千山',\n",
       "   '沈雪香',\n",
       "   '誠信投資(股)',\n",
       "   '王盈之',\n",
       "   '基創實業(股)',\n",
       "   '鍾亮宏',\n",
       "   '葉明球',\n",
       "   '有為投資(有)-林文鵬',\n",
       "   '林曼麗',\n",
       "   '林澤鈿',\n",
       "   '陳延芬',\n",
       "   '許逸民',\n",
       "   '安鼎投資(股)-葉文隆',\n",
       "   '安答投資(股)',\n",
       "   '葉誌榮',\n",
       "   '廖致翔',\n",
       "   '謝修平',\n",
       "   '蔡稼光',\n",
       "   '謝國棟',\n",
       "   '林月廷',\n",
       "   '林芳如',\n",
       "   '史守威',\n",
       "   '公誠興業(股)',\n",
       "   '陳重瑞',\n",
       "   '安和投資控股(股)',\n",
       "   '許逸晟',\n",
       "   '三功租賃(股)',\n",
       "   '安達鑫投資(股)-葉姿伶',\n",
       "   '陳盟岳',\n",
       "   '徐卓鳳嬌',\n",
       "   '吳小圓',\n",
       "   '徐維宏',\n",
       "   '林茂盛',\n",
       "   '林添峰',\n",
       "   '張忠賀',\n",
       "   '黃啟曄',\n",
       "   '同安化工企業(股)',\n",
       "   '何睿楠',\n",
       "   '吳尚穎',\n",
       "   '安和投資控股(股)-葉文隆',\n",
       "   '洪堯昆',\n",
       "   '朱慧龍',\n",
       "   '晉昇投資(有)-許逸群',\n",
       "   '李宜荃',\n",
       "   '洪堯浩',\n",
       "   '洪堯欣',\n",
       "   '泰生海洋開發(股)-林月廷',\n",
       "   '黃秀卿',\n",
       "   '戴禎慧',\n",
       "   '朱惠芬',\n",
       "   '楊倉富',\n",
       "   '洪堯棟',\n",
       "   '慧德國際(股)-黃蘊慧',\n",
       "   '黃蘊慧',\n",
       "   '吳柏峻',\n",
       "   '大茂道原(股)',\n",
       "   '茂元國際(股)-葉明球',\n",
       "   '黃大祐',\n",
       "   '謝清雲基金會',\n",
       "   '懷德保險代理(股)-許偉平',\n",
       "   '合瑞實業(股)',\n",
       "   '吳金泉',\n",
       "   '安鼎投資(股)-吳星澄',\n",
       "   '任耀庭',\n",
       "   '杜振發',\n",
       "   '泰生海洋開發(股)-葉文隆',\n",
       "   '葉能律',\n",
       "   '陳祺炆',\n",
       "   '高俊清',\n",
       "   '安鼎投資(股)-謝幸珍',\n",
       "   '王堯風',\n",
       "   '安鼎投資(股)',\n",
       "   '三功國際(股)-王盈之',\n",
       "   '許邦福',\n",
       "   '黃文宏',\n",
       "   '謝林興業(股)',\n",
       "   '王仁志',\n",
       "   '林相妤']},\n",
       " {'cluster': 1,\n",
       "  'members': ['陳紹偉',\n",
       "   '鴻僑投資(有)-金文衡',\n",
       "   '陳威丞',\n",
       "   '李裕隆',\n",
       "   '張哲明',\n",
       "   '傅俊貿',\n",
       "   '林正恭',\n",
       "   '李家宜',\n",
       "   '蔡高忠',\n",
       "   '徐維志',\n",
       "   '嘉泰投資開發(股)-詹玉芳',\n",
       "   '楊建龍',\n",
       "   '許瑞軒',\n",
       "   '邱文達',\n",
       "   '金瑛發機械工(股)-施松林',\n",
       "   '王建弘',\n",
       "   '伊蘿興投資(有)',\n",
       "   '國際纖維科技(股)-謝明健',\n",
       "   '蔡德修',\n",
       "   '昕順興投資(有)',\n",
       "   '楊璧紅',\n",
       "   '弘誠投資(股)-林子軒',\n",
       "   '白溪河',\n",
       "   '邱信榮',\n",
       "   '劉家瑞',\n",
       "   '陳啟昌',\n",
       "   '呂月森',\n",
       "   '王志恒',\n",
       "   '葉振民',\n",
       "   '黃博聲',\n",
       "   '林祈旭',\n",
       "   '戰神科技投資(有)',\n",
       "   '蔡耀文',\n",
       "   '黃琮煥',\n",
       "   '姜呈冀',\n",
       "   '黃義熊',\n",
       "   '瑄造實業(股)-馬健健',\n",
       "   '陳國泰',\n",
       "   '郭宗雄',\n",
       "   '吳森泉',\n",
       "   '陳鳳明',\n",
       "   '周俊男',\n",
       "   '謝振銘',\n",
       "   '李敦禮',\n",
       "   '高雄汽車客運(股)-鍾欣倍',\n",
       "   '洪俊銘',\n",
       "   '賴呈瑞',\n",
       "   '謝智通',\n",
       "   '蘇浩熙',\n",
       "   '謝金虎',\n",
       "   '文經開發(股)',\n",
       "   '德銀哈伯國際',\n",
       "   '國軍退除役官-楊長政',\n",
       "   '于澤人',\n",
       "   '劉松柏',\n",
       "   '敏欣投資(股)-陳涵琦',\n",
       "   '何慶生',\n",
       "   '蘇天寶',\n",
       "   '林尚弘',\n",
       "   '豐鑫開發投資(股)-陳瓊玲',\n",
       "   '李宏文',\n",
       "   '洪榮一',\n",
       "   '紘灣投資有限(有)-林金柱',\n",
       "   '欣邦投資開發(股)',\n",
       "   '鄭素惠',\n",
       "   '毛惠寬',\n",
       "   '緯創資通(股)-林憲銘',\n",
       "   '謝果達',\n",
       "   '成春投資有限(有)',\n",
       "   '王家宜',\n",
       "   '吳德豐',\n",
       "   '興瀚投資(有)-施教興',\n",
       "   '林金城',\n",
       "   '李亞卿',\n",
       "   '陸炤文',\n",
       "   '李威進',\n",
       "   '池雅琴',\n",
       "   '展圖 (香港)(有)-熊雅意',\n",
       "   '張季明',\n",
       "   '簡婉麗',\n",
       "   '蔡家鴻',\n",
       "   '李燕松',\n",
       "   '陳秀月',\n",
       "   '姚文伶',\n",
       "   '長榮海運(股)-林寶水',\n",
       "   '張家安',\n",
       "   '張仁迪',\n",
       "   '李弘信',\n",
       "   '陳錫智',\n",
       "   '春穗投資實業(股)',\n",
       "   '吳田玉',\n",
       "   '永慧開發(有)-蘇一仲',\n",
       "   '陳唯泰',\n",
       "   '呂世民',\n",
       "   '朋程科技(股)-盧建志',\n",
       "   '陳瓊芳',\n",
       "   '金泉投資(股)',\n",
       "   '廖學遠',\n",
       "   '王玲華',\n",
       "   '張治',\n",
       "   '成志投資(股)',\n",
       "   '勇信開發(股)-李建成',\n",
       "   '劉祥泰',\n",
       "   '李怡寧',\n",
       "   '林世銘',\n",
       "   '賈漢榮',\n",
       "   '東菱投資(股)-劉嘉昇',\n",
       "   '顏邦修',\n",
       "   '張啟訓',\n",
       "   '毛郅國',\n",
       "   '凌瓏',\n",
       "   '日本通運(股)',\n",
       "   '倪燕菁',\n",
       "   '王友泉',\n",
       "   '陳鴻璋',\n",
       "   '陳楊美陳友南',\n",
       "   '莫昭平',\n",
       "   '李承緒',\n",
       "   '吳其熊',\n",
       "   '三永投資(股)-邱宏哲',\n",
       "   '高孔廉',\n",
       "   '偉仁食品(股)-張振雲',\n",
       "   '張世淳',\n",
       "   '蘇育正',\n",
       "   '陳秋芬',\n",
       "   '葉燦鍊',\n",
       "   '啟創投資(股)',\n",
       "   '台灣人壽委託',\n",
       "   '金仲仁',\n",
       "   '華新麗華(股)-潘文虎',\n",
       "   '劉文章',\n",
       "   '福興股份有限(股)',\n",
       "   '廖陳成',\n",
       "   '張德旭',\n",
       "   '沈堯生',\n",
       "   '黎文斌',\n",
       "   '呂紹榮',\n",
       "   '福陞興業(股)',\n",
       "   '信邦電子(股)-王紹新',\n",
       "   '徐旭東',\n",
       "   '何台桹',\n",
       "   '陳臣璽',\n",
       "   '顧永鎗',\n",
       "   '定勝資本股份(股)-羅仕溢',\n",
       "   '李文仁',\n",
       "   '鴻揚創業投資(股)',\n",
       "   '陳虹蒨',\n",
       "   '林群國',\n",
       "   '張逸釩',\n",
       "   '莊青熹',\n",
       "   '朱盈璇',\n",
       "   '統一國際開發(股)-李秉穎',\n",
       "   '元齊投資(股)',\n",
       "   '嘉悉股份有限(股)-林高順',\n",
       "   '曾懷億',\n",
       "   '日東紡績株式(股)-五十嵐和彥',\n",
       "   '梁耀明',\n",
       "   '宋建斌',\n",
       "   '康輝投資(股)',\n",
       "   '宜富建設(股)',\n",
       "   '豐富國際開發(股)',\n",
       "   '謝宗儒',\n",
       "   '鄭孟鑫',\n",
       "   '鄧彬斌',\n",
       "   '程立偉',\n",
       "   '易致股份有限(股)-李正漢',\n",
       "   '遠東新世紀(股)-張才雄',\n",
       "   '皇翔投資(股)-廖年吉',\n",
       "   '黃鈺文',\n",
       "   '劉俊斌',\n",
       "   '周步朗',\n",
       "   '林孝信',\n",
       "   '秦克煒',\n",
       "   '簡聖潔',\n",
       "   '陳萬方',\n",
       "   '林建平',\n",
       "   '陳國課',\n",
       "   '莊明宏',\n",
       "   '蔡德軒',\n",
       "   '謝文斌',\n",
       "   '曾盛斌',\n",
       "   '信邦電子(股)-黃文森',\n",
       "   '戴國瑛',\n",
       "   '高恒投資(股)',\n",
       "   '陳宣慧',\n",
       "   '椰子(股)',\n",
       "   '賴永吉',\n",
       "   '賴金德',\n",
       "   '第一商業銀信',\n",
       "   '鄭乃芳',\n",
       "   '何建興',\n",
       "   '柯懿紘',\n",
       "   '盧宗焜',\n",
       "   '行政院國家發-吳文貴',\n",
       "   '賴靜鳳',\n",
       "   '詹益燿',\n",
       "   '蔡永祿',\n",
       "   '張祥麟',\n",
       "   '富品投資(股)-王伯元',\n",
       "   '潤華染織廠(股)',\n",
       "   '鄭連宏',\n",
       "   '沈春池基金會-沈輝庭',\n",
       "   '史李爝珠',\n",
       "   '呂秀鳳',\n",
       "   '王宏',\n",
       "   '陳彥彰',\n",
       "   '郭錫榮',\n",
       "   '張偉鈞',\n",
       "   '陳淑貞',\n",
       "   '亞洲聚合(股)-高哲一',\n",
       "   '雷淑芬',\n",
       "   '羅閎逸',\n",
       "   '何榮源',\n",
       "   '山隆通運(股)',\n",
       "   '紀榮煌',\n",
       "   '邱士榮',\n",
       "   '新群實業(股)',\n",
       "   '呂永恭',\n",
       "   '有力投資(有)-莊育德',\n",
       "   '郭博達',\n",
       "   '吳清源',\n",
       "   '李正毅',\n",
       "   '米本勝行',\n",
       "   '陳景昌',\n",
       "   '玖旺投資(有)-劉家成',\n",
       "   '巴黎財務新加',\n",
       "   '鄭乃程',\n",
       "   '保雷國際(有)-陳冠百',\n",
       "   '王詹定',\n",
       "   '富邦銀託堡勝',\n",
       "   '蔡祺文',\n",
       "   '三商美邦人壽(股)',\n",
       "   '李宇旼',\n",
       "   '李大彰',\n",
       "   '林珮瑜',\n",
       "   '劉清郎',\n",
       "   '余(日告)榛',\n",
       "   '葉讚桐',\n",
       "   '林麥升',\n",
       "   '吳賢明',\n",
       "   '許翠芸',\n",
       "   '泰富投資(股)',\n",
       "   '劉純玟',\n",
       "   '天騰工業(股)',\n",
       "   '凱駿投資(股)-徐美玲',\n",
       "   '陳建惇',\n",
       "   '方玉燕',\n",
       "   '朱中強',\n",
       "   '江丁課',\n",
       "   '賈志中',\n",
       "   '中國信託-020',\n",
       "   '李振文',\n",
       "   '鄭朝文',\n",
       "   '林文淵',\n",
       "   '孫震東',\n",
       "   '簡芳模',\n",
       "   '鄭俊聲',\n",
       "   '許付松',\n",
       "   '林經洲',\n",
       "   '連華榮',\n",
       "   'Well Eminent(有)',\n",
       "   '王道商業銀行(股)-吳正慶',\n",
       "   '頤宗投資(股)-吳旻潔',\n",
       "   'Fame Hin Inv(有)-盧宗明',\n",
       "   '康益全',\n",
       "   '鏵鴻實業(有)',\n",
       "   '王永明',\n",
       "   '戴錦銓',\n",
       "   '鄭全誠',\n",
       "   '林道孝',\n",
       "   '太明開發(股)',\n",
       "   '新光開發(股)-陳秀美',\n",
       "   '葛保羅',\n",
       "   '詠沛投資(有)',\n",
       "   '陳俊智',\n",
       "   '謝錦昌',\n",
       "   '吳宜臻',\n",
       "   '富邦託大同藥',\n",
       "   '伍開雲',\n",
       "   '余素緣',\n",
       "   '戴美惠',\n",
       "   '許振昌',\n",
       "   '張玉美',\n",
       "   '高瑜婷',\n",
       "   '張瑋庭',\n",
       "   '羅偉碩',\n",
       "   '方明達',\n",
       "   '郭俊宏',\n",
       "   '王健民',\n",
       "   '李文鴻',\n",
       "   '吳榮水',\n",
       "   '黃文正',\n",
       "   '黃民進',\n",
       "   '陳宗曉',\n",
       "   '林志剛',\n",
       "   '何德佑',\n",
       "   '邱垂健',\n",
       "   '涂昀',\n",
       "   '沈榮裕',\n",
       "   '賴允中',\n",
       "   '洪明達',\n",
       "   '鐘正皇',\n",
       "   '顏鳳鄰',\n",
       "   '黃政齊',\n",
       "   '吳逸賢',\n",
       "   '莊凌鋒',\n",
       "   '褚世傑',\n",
       "   '匯凌投資(有)',\n",
       "   '林裕軒',\n",
       "   '簡麗真',\n",
       "   '行政院國家發-施克和',\n",
       "   '施文進',\n",
       "   '華桐投資(股)',\n",
       "   '吳忠懌',\n",
       "   '捷朗投資(股)',\n",
       "   '藍慶應',\n",
       "   '許瑞通',\n",
       "   '程耀儀',\n",
       "   '匯豐託管ENSI',\n",
       "   '阮岳澤',\n",
       "   '謝青珊',\n",
       "   '匯豐託安大略',\n",
       "   '伯光企業(股)-Paul A. Hs',\n",
       "   '吳正煥',\n",
       "   '郭惠英',\n",
       "   '智凱開發(股)',\n",
       "   '管源雙',\n",
       "   '鍾金釧',\n",
       "   '貿芙投資(股)',\n",
       "   '鵬霖投資(有)-曾達夢',\n",
       "   '胡羅娟娟',\n",
       "   '陳鏡仁',\n",
       "   '龍笛實業(股)-劉康信',\n",
       "   '合昕實業(股)-張清櫆',\n",
       "   '建漢科技(股)-吳忠和',\n",
       "   '蕭乃彰',\n",
       "   '廖永隆',\n",
       "   '陳守信',\n",
       "   '林嘉宏',\n",
       "   '張祐瑄',\n",
       "   '錢湘蓉',\n",
       "   '張澤坤',\n",
       "   '金多利企業(股)-翁華廷',\n",
       "   '陳屏',\n",
       "   '天欣投資(股)',\n",
       "   '沈倩怡',\n",
       "   '蔡智誠',\n",
       "   '曾柏銓',\n",
       "   '劉清香',\n",
       "   '葉志鴻',\n",
       "   '蔡賜慶',\n",
       "   '劉品均',\n",
       "   '梁哲彬',\n",
       "   '郭立偉',\n",
       "   '亨通機械(股)',\n",
       "   '中華開發金融(股)-施惠琪',\n",
       "   '楊秀權',\n",
       "   '潘朵拉投資有(有)',\n",
       "   '劉正元',\n",
       "   '陳士偉',\n",
       "   '帝星國際有限(有)',\n",
       "   '世豐螺絲(股)',\n",
       "   '黃品睿',\n",
       "   '陳祖雄',\n",
       "   '張甄珍',\n",
       "   '黃竫筌',\n",
       "   '李家騏',\n",
       "   '宋海崙',\n",
       "   '郭淑宜',\n",
       "   '創高投資(股)',\n",
       "   '翁成順',\n",
       "   '陳映兆',\n",
       "   '黃文書',\n",
       "   '何翊文',\n",
       "   '楊芝青',\n",
       "   '葉俊瑋',\n",
       "   '朱東燦',\n",
       "   '廖冠翔',\n",
       "   '楊明曄',\n",
       "   '蕭博銘',\n",
       "   '日立歐姆龍金(有)',\n",
       "   '林淑媛',\n",
       "   '曾進成',\n",
       "   '高蘭芬',\n",
       "   '黃建豪',\n",
       "   '蔡松棋',\n",
       "   '林少莆',\n",
       "   '蔡謀賦',\n",
       "   '陳建雄',\n",
       "   '高東海',\n",
       "   '陳柏翰',\n",
       "   '江孟真',\n",
       "   '蔡人華',\n",
       "   '葉光華',\n",
       "   '鄭純農',\n",
       "   '許振榮',\n",
       "   '豐藝電子(股)-陳安迪',\n",
       "   '董加亭',\n",
       "   '洪玲君',\n",
       "   '劉錦章',\n",
       "   '張良銘',\n",
       "   '邱進益',\n",
       "   '登豐投資開發(有)-顏瑞賢',\n",
       "   '陳弘生',\n",
       "   '摩根保管特寶',\n",
       "   '楊省吾',\n",
       "   '鄭達誠',\n",
       "   '楊順進',\n",
       "   '蔡建文',\n",
       "   '蔡美娥',\n",
       "   '塗能謀',\n",
       "   '林孟毅',\n",
       "   '林春成',\n",
       "   '復華傳家二號',\n",
       "   '洪彥祥',\n",
       "   '高振益',\n",
       "   '江瑞瑭',\n",
       "   '林宏誠',\n",
       "   '裕利投資(股)-莊曉波',\n",
       "   '保力達股份有(股)',\n",
       "   '吳宇中',\n",
       "   '岱盈投資(股)-江漢斌',\n",
       "   '劉振',\n",
       "   '呂慶泰',\n",
       "   '陳仁安',\n",
       "   '昌新投資開發(有)-沈景鵬',\n",
       "   '張家祝',\n",
       "   '陳朝淵',\n",
       "   '常德投資(股)-林興國',\n",
       "   '蔡嘉鐘',\n",
       "   '顏大鈞',\n",
       "   '劉彥霈',\n",
       "   'Yonggu Group',\n",
       "   '廣達電腦(股)-黃健堂',\n",
       "   '林姬貞',\n",
       "   '浩瀚國際投資(股)-鄭亭玉',\n",
       "   '吳琦',\n",
       "   '彭仁賓',\n",
       "   '鄧愛櫻',\n",
       "   '張年成',\n",
       "   '台玉投資(股)',\n",
       "   '黃麟添',\n",
       "   '高長平',\n",
       "   '林郁萱',\n",
       "   '余俊彥',\n",
       "   '林靜慧',\n",
       "   '威聯通科技(股)-張明智',\n",
       "   '林泉源',\n",
       "   '黃惠雯',\n",
       "   '李培祥',\n",
       "   '張凱明',\n",
       "   '吳啟豪',\n",
       "   '徐宏銘',\n",
       "   '東樹投資(股)-陳敏斷',\n",
       "   '翁一新',\n",
       "   '朋萊(股)-游明俊',\n",
       "   '卓君弘',\n",
       "   '劉博文',\n",
       "   '世商國際有限(有)',\n",
       "   '徐立婷',\n",
       "   '葉清來',\n",
       "   '陳標春',\n",
       "   '李永全',\n",
       "   '友達光電(股)-蔡國新',\n",
       "   '黃茂源',\n",
       "   '楊潤光',\n",
       "   '黃調貴',\n",
       "   '方秋英',\n",
       "   '黃文芳',\n",
       "   '楊峻銘',\n",
       "   '夏青璇',\n",
       "   '東友科技(股)',\n",
       "   '游克用',\n",
       "   '陳麗惠',\n",
       "   '鄭慧敏',\n",
       "   '臺銀保管JOHC',\n",
       "   '顏嘉悅',\n",
       "   '黃郁之',\n",
       "   '李清和',\n",
       "   '蕭大誠',\n",
       "   '賴佳誼',\n",
       "   '許俐雅',\n",
       "   '楊琇雅',\n",
       "   '陳宜賢',\n",
       "   '台灣鋼鐵(有)',\n",
       "   '葉春女',\n",
       "   '方文宏',\n",
       "   '林宏聲',\n",
       "   '林佩瓊',\n",
       "   '林德偉',\n",
       "   '統懋投資(股)-王聖鈞',\n",
       "   '周玉庭',\n",
       "   '呂國煌',\n",
       "   '潘錦龍',\n",
       "   '頎邦科技(股)',\n",
       "   '呂惠清',\n",
       "   '蘇志成',\n",
       "   '吳連富',\n",
       "   '林克倫',\n",
       "   '銀豐實業(股)-劉敬村',\n",
       "   '陳建源',\n",
       "   '張晉騰',\n",
       "   '陳苑霖',\n",
       "   '周賢彰',\n",
       "   '蔡靜儀',\n",
       "   '葉柏君',\n",
       "   '德銀託管NT亞',\n",
       "   '蔡正義',\n",
       "   '陳佩利',\n",
       "   '張新和',\n",
       "   '曾山一',\n",
       "   '廣源投資(股)',\n",
       "   '楊志強',\n",
       "   '冠益投資(股)',\n",
       "   '冠澤(股)',\n",
       "   '吳程遠',\n",
       "   '焯見投資(股)-王煒',\n",
       "   '詹世賢',\n",
       "   '舜程投資(有)-許智傑',\n",
       "   '大天投資(股)-蕭祥玲',\n",
       "   '許惠森',\n",
       "   '家賀投資(股)',\n",
       "   '宋俊明',\n",
       "   '賴銘榮',\n",
       "   '曹淑琴',\n",
       "   '易岑投資(股)-顏群育',\n",
       "   '劉佩怡',\n",
       "   '李躬富',\n",
       "   '張宏臺',\n",
       "   '田嘉昇',\n",
       "   '彼得.邦菲',\n",
       "   '陳麗秀',\n",
       "   '鈺欣投資(有)-陳俊成',\n",
       "   '洪葳勝',\n",
       "   '鍾志?',\n",
       "   '財欣國際投資(股)-李學坤',\n",
       "   '馬來西亞商D&-LEE HAN YU',\n",
       "   '溢信投資有限(有)',\n",
       "   '世良澤投資(股)',\n",
       "   '蔡篤恭',\n",
       "   '蔡宗憲',\n",
       "   '沈啟勇',\n",
       "   '佳世達科技(股)-陳其宏',\n",
       "   '張右仕',\n",
       "   '賴明添',\n",
       "   '張文龍',\n",
       "   '潘少昀',\n",
       "   '郭弘正',\n",
       "   '陳慶福',\n",
       "   '長興材料工業(股)-潘金城',\n",
       "   '陳重義',\n",
       "   '蘇雅鈴',\n",
       "   '何聘賢',\n",
       "   '莊育德',\n",
       "   '魏景川',\n",
       "   '周經緯',\n",
       "   '林文源',\n",
       "   '黃俊達',\n",
       "   '友達光電(股)-廖唯倫',\n",
       "   '徐季麟',\n",
       "   '彭智良',\n",
       "   '熊秉政',\n",
       "   '李弘暉',\n",
       "   '玉山託高銘傳',\n",
       "   '郭寶聲',\n",
       "   '黃雅翌',\n",
       "   '維安投資(有)',\n",
       "   '許智良',\n",
       "   '魏鴻詳',\n",
       "   '陳簡寶貴',\n",
       "   '吳巨聖',\n",
       "   '謝長宏',\n",
       "   '陽光投資(有)-李碧淑',\n",
       "   '黃國祥',\n",
       "   '黃文彥',\n",
       "   '吳麗卿',\n",
       "   '林泓毅',\n",
       "   '邱靖博',\n",
       "   '賴人禾',\n",
       "   '楊瑞祥',\n",
       "   '趙冠宇',\n",
       "   '張福生',\n",
       "   '梁秀如',\n",
       "   '行政院國家發-張建一',\n",
       "   '許順吉',\n",
       "   '皇銘實業(股)',\n",
       "   '徐佩琳',\n",
       "   '洪佳伶',\n",
       "   '廣盈國際投資',\n",
       "   '王道商業銀行(股)-魏政祥',\n",
       "   '葉威廷',\n",
       "   '李淑惠',\n",
       "   '林小玲',\n",
       "   '黃麗珍',\n",
       "   '張俞政',\n",
       "   '王聖芳',\n",
       "   '葉樹煇',\n",
       "   '富堯投資(股)-張惟森',\n",
       "   '孫清榮',\n",
       "   '黃拓文',\n",
       "   '榮志投資(有)',\n",
       "   '李熙琤',\n",
       "   '徐永安',\n",
       "   '林俊一',\n",
       "   '黃俊幸',\n",
       "   'Happy Ball L(有)',\n",
       "   '陳昱曉',\n",
       "   '林家興',\n",
       "   '林文裕',\n",
       "   '張哲銘',\n",
       "   '藍麗玲',\n",
       "   '邱啟旼',\n",
       "   '吳宗訓',\n",
       "   '薛家瑜',\n",
       "   '吳春富',\n",
       "   '董濟仁',\n",
       "   '蘇炎坤',\n",
       "   '林呈',\n",
       "   '黃麗娟',\n",
       "   '嘉祐投資(股)-朱德祥',\n",
       "   '馮玉英',\n",
       "   '王安倫',\n",
       "   '謝嘉修',\n",
       "   '蔡嘉益',\n",
       "   '黃鉉富',\n",
       "   '林進塗',\n",
       "   '謝宜璋',\n",
       "   '台塑海運(股)',\n",
       "   '寬鑫投資(股)-郭飛龍',\n",
       "   '宿文堂',\n",
       "   '魏世芳',\n",
       "   '翁華利',\n",
       "   '莊佳哲',\n",
       "   '廖東雄',\n",
       "   '鄭聖夫',\n",
       "   '彭淑玫',\n",
       "   '方郁龍',\n",
       "   '楊新泓',\n",
       "   '陳正章',\n",
       "   '安和國際投資(股)',\n",
       "   '蘇雅惠',\n",
       "   '曾永輝',\n",
       "   '曾馨慧',\n",
       "   '簡東捷',\n",
       "   '李柏磊',\n",
       "   '金澤投資(股)',\n",
       "   '陳弘財',\n",
       "   '林秀榿',\n",
       "   '林登海',\n",
       "   '莊雅閔',\n",
       "   '劉芝秀',\n",
       "   '洪穎',\n",
       "   '黃德丹',\n",
       "   '泰力實業(股)',\n",
       "   '鄭振家',\n",
       "   '田俊得',\n",
       "   '吳錦芳',\n",
       "   '姜禮銘',\n",
       "   '黃欽杉',\n",
       "   '大台北區瓦斯(股)-吳昕東',\n",
       "   '蔡文卿',\n",
       "   '林豪宇',\n",
       "   '陳奇慕',\n",
       "   '吳幸純',\n",
       "   '陳卓勳',\n",
       "   '莊育民',\n",
       "   '洪嘉鴻',\n",
       "   '陳淳德',\n",
       "   '賴錫楠',\n",
       "   '胡首強',\n",
       "   '王家慧',\n",
       "   '許振煙',\n",
       "   '陳忠源',\n",
       "   '李梓宏',\n",
       "   '李琇絹',\n",
       "   '新光三越百貨(股)-葉雲萬',\n",
       "   '黃新年',\n",
       "   '台灣人壽保險(股)',\n",
       "   '劉汝勇',\n",
       "   '振悅投資(有)',\n",
       "   '蘇育文',\n",
       "   '大虹投資(股)',\n",
       "   '江錦樺',\n",
       "   '林妤珊',\n",
       "   '吳政學',\n",
       "   '裕鼎實業(股)-侯金英',\n",
       "   '郭戎',\n",
       "   '姜筱梅',\n",
       "   'OpNow Soluti(股)-趙偉州',\n",
       "   '美實國際有限(有)',\n",
       "   '遠進(股)-林文哲',\n",
       "   '劉凱文',\n",
       "   '李茂盛',\n",
       "   '蔡梅娜',\n",
       "   '魏榮宏',\n",
       "   '莊志揚',\n",
       "   '施顯富',\n",
       "   '胡志平',\n",
       "   '王建業',\n",
       "   '上立汽車(股)-吳建立',\n",
       "   '江建正',\n",
       "   '李文秀',\n",
       "   '林秀穎',\n",
       "   '楊俊勇',\n",
       "   '邱士楷',\n",
       "   '郭震宇',\n",
       "   '黃慶祥',\n",
       "   '趙宇天',\n",
       "   '王靖欽',\n",
       "   '田念蘭',\n",
       "   '洪吉山',\n",
       "   '林挺立',\n",
       "   '李俊治',\n",
       "   '林志宏',\n",
       "   '呂天耀',\n",
       "   '愛斯佳投資(股)',\n",
       "   '高第投資(股)-金諭',\n",
       "   '展曄投資(有)-王冠中',\n",
       "   '匯豐高林基金',\n",
       "   '黃獻群',\n",
       "   '黃凱靖',\n",
       "   '陳火亮',\n",
       "   '大台北區瓦斯(股)-吳欣儒',\n",
       "   '范振祥',\n",
       "   '尚鼎投資事業(股)',\n",
       "   '和橋實業(股)',\n",
       "   '林顯源',\n",
       "   '李盈陵',\n",
       "   '巫碧蕙',\n",
       "   '簡俊哲',\n",
       "   '許德慧',\n",
       "   '高妙華',\n",
       "   '周逸修',\n",
       "   '潘建州',\n",
       "   '郭治平',\n",
       "   '程英珠',\n",
       "   '朱蜀詠',\n",
       "   '曾孟雲',\n",
       "   '張少謙',\n",
       "   '啟碁科技(股)-高健榮',\n",
       "   '楊耀欽',\n",
       "   '林純正',\n",
       "   'Casey K. Tun',\n",
       "   '林朝源',\n",
       "   '林東昇',\n",
       "   '蔡兆挺',\n",
       "   '黃意堅',\n",
       "   '華晟投資(股)-陳斐暄',\n",
       "   '嚴振誠',\n",
       "   '張雅柔',\n",
       "   '鄒偉基',\n",
       "   '賴富信',\n",
       "   '王瑞峰',\n",
       "   '賴和貴',\n",
       "   '金點資產管理(有)-鄭志發',\n",
       "   '遊龍投資(股)',\n",
       "   '林澤森',\n",
       "   '林黃揚',\n",
       "   '上智生技創業(股)-張鴻仁',\n",
       "   '李大倫',\n",
       "   '隆貿投資(股)',\n",
       "   '廖建勛',\n",
       "   '容玉投資(股)',\n",
       "   '王冠羚',\n",
       "   '楊鎮瑀',\n",
       "   '許承煜',\n",
       "   '邱美玲',\n",
       "   '曾憲政',\n",
       "   '詹順凱',\n",
       "   '陳季杏',\n",
       "   '譚建強',\n",
       "   '陳志展',\n",
       "   '周國陽',\n",
       "   '潘武雄',\n",
       "   '陳思正',\n",
       "   '鍾佩君',\n",
       "   '洪聖壹',\n",
       "   '黃啟瑞',\n",
       "   '朱駿崴',\n",
       "   '翁建勝',\n",
       "   '羅威信投資(有)',\n",
       "   '徐亦翠',\n",
       "   '渣打台灣指數',\n",
       "   '梁清海',\n",
       "   '善德投資(股)-黃朝豐',\n",
       "   '廖成蔭',\n",
       "   '詹進益',\n",
       "   '翁耀林',\n",
       "   '葉步賢',\n",
       "   '張千里',\n",
       "   '黃立恒',\n",
       "   '世達興實業(股)-周維昆',\n",
       "   '石正復',\n",
       "   '航嘉投資(股)',\n",
       "   '林茂興',\n",
       "   '林攸彥',\n",
       "   '于俊潔',\n",
       "   '王穎笙',\n",
       "   '詠祥投資有限(有)',\n",
       "   '廖弘偉',\n",
       "   '馮億苓',\n",
       "   '陳又榮',\n",
       "   '維善投資(股)-蘇建吉',\n",
       "   '汪采樺',\n",
       "   '蔡高明',\n",
       "   '姜震',\n",
       "   '研揚科技(股)-林建宏',\n",
       "   '彭士祐',\n",
       "   '陳幸君',\n",
       "   '林河輝',\n",
       "   '林國忠',\n",
       "   '葉文華',\n",
       "   '林之晨',\n",
       "   '鴻奇煤氣分裝(有)',\n",
       "   '鄭子銘',\n",
       "   '粘碧真',\n",
       "   '國錩事業(股)',\n",
       "   '江炯煌',\n",
       "   '金寶電子工業(股)-陳威昌',\n",
       "   '磐亞(股)',\n",
       "   '李佳勳',\n",
       "   '長榮國際(股)-柯麗卿',\n",
       "   '許曉琪',\n",
       "   '邱幸惠',\n",
       "   '徐佩文',\n",
       "   '許守銘',\n",
       "   '許淑卿',\n",
       "   '林昭吟',\n",
       "   '黃怡萱',\n",
       "   '洪青霞',\n",
       "   '許信介',\n",
       "   '健勤投資(股)-鄧文惠',\n",
       "   '楊蕙華',\n",
       "   '京富投資(有)-佘欣欣',\n",
       "   '東華企業(有)',\n",
       "   '劉守晏',\n",
       "   '孫正雄',\n",
       "   'Richard Walt',\n",
       "   '高怡君',\n",
       "   '黃金貞',\n",
       "   '王宜倫',\n",
       "   '林寶水',\n",
       "   '王秀枝',\n",
       "   'Dazzle Co.,(股)',\n",
       "   '宏育投資(股)',\n",
       "   '林芷帆',\n",
       "   'Olivia Globa(股)',\n",
       "   '羅培源',\n",
       "   '謝汶芳',\n",
       "   '維京吉興國際(有)',\n",
       "   '天福投資(股)-李國麟',\n",
       "   '福元投資(股)-林瑞章',\n",
       "   '新光合成纖維(股)-施火灶',\n",
       "   'Elemental Cr(有)',\n",
       "   '中信銀託誠邦',\n",
       "   '林雅蘋',\n",
       "   '陳國世',\n",
       "   '林禎民',\n",
       "   '元大金融控股(股)-李岳蒼',\n",
       "   '李柱信',\n",
       "   '許麗芬',\n",
       "   '胡泰祥',\n",
       "   '謝萬禮',\n",
       "   '陳章泰',\n",
       "   '王威中',\n",
       "   '孫明榮',\n",
       "   '李應杰',\n",
       "   '張佳章',\n",
       "   '許春堂',\n",
       "   '魏諦斯',\n",
       "   '丁靜',\n",
       "   '龍巖(股)-蔡文杰',\n",
       "   '大聯大投資控(股)-黃偉祥',\n",
       "   '長榮航空(股)-林寶水',\n",
       "   '廖昭惠',\n",
       "   '李克敬',\n",
       "   '周進文',\n",
       "   '林俊格',\n",
       "   '黃慶宗',\n",
       "   '方和慶',\n",
       "   '張世極',\n",
       "   '黃明月',\n",
       "   '遠東百貨股份(股)',\n",
       "   '富民運輸(股)',\n",
       "   '林廷芳',\n",
       "   '徐秀芬',\n",
       "   'Monster Hold(股)-呂朝勝',\n",
       "   '蔡孝毅',\n",
       "   '翔肇股份有限(股)-郭瑞嵩',\n",
       "   '賴錦億',\n",
       "   '郭旭東',\n",
       "   '大通美國收益',\n",
       "   '林芳戎',\n",
       "   '梁贏之',\n",
       "   '邱晉誼',\n",
       "   '王憶秋',\n",
       "   '周秋美',\n",
       "   '伽倫投資(股)-黃玉芬',\n",
       "   '蘇永阜',\n",
       "   '李淳',\n",
       "   '徐景生',\n",
       "   '信安企業有限(有)',\n",
       "   '黃若漢',\n",
       "   '黃偉祥',\n",
       "   '美商摩根-008',\n",
       "   '夏徐生',\n",
       "   '余厚生',\n",
       "   '許柏澄',\n",
       "   '鄭靜怡',\n",
       "   '倪寒芬',\n",
       "   '朱怡',\n",
       "   '洪紹甫',\n",
       "   '昱明投資(股)-傅慧貞',\n",
       "   '蔡粧舜',\n",
       "   '怡和財務顧(股)-王伯元',\n",
       "   '李文機',\n",
       "   '鄭譓珆',\n",
       "   '莊隆霖',\n",
       "   '黃復枝',\n",
       "   '花旗台日月光',\n",
       "   '余丹聞',\n",
       "   '柯俊宇',\n",
       "   '張志航',\n",
       "   '王淑玲',\n",
       "   '汪建宏',\n",
       "   '金鑫投資(股)-蘇源茂',\n",
       "   '劉建邦',\n",
       "   '張初子',\n",
       "   '豐昕(股)-張素真',\n",
       "   '呂錦任',\n",
       "   '全貿投資(股)-劉時立',\n",
       "   '裕順投資開發(股)-張嘉亨',\n",
       "   '林錦莉',\n",
       "   '葉錦興',\n",
       "   '劉長坤',\n",
       "   '謝錦堂',\n",
       "   '陳廣洪',\n",
       "   '張家茵',\n",
       "   '陳義方',\n",
       "   '侯智仁',\n",
       "   '吳敏弘',\n",
       "   '羅雪茹',\n",
       "   '台北市政府-袁秀慧',\n",
       "   '張益宗',\n",
       "   '謝禎誠',\n",
       "   '景匯投資(股)-余珊蓉',\n",
       "   '楊智鈞',\n",
       "   '泰霖投資(股)-周忠發',\n",
       "   '李宗光',\n",
       "   '陳立英',\n",
       "   '周詠翔',\n",
       "   '楊宗興',\n",
       "   '陳銘賢',\n",
       "   '顏志達',\n",
       "   '卓銳(股)-黃祈融',\n",
       "   '游家傑',\n",
       "   '李雨華',\n",
       "   '江志雄',\n",
       "   '新木能源(股)-代表人1',\n",
       "   '羅文驥',\n",
       "   '義美(股)',\n",
       "   '泰詠投資(股)-陳豊明',\n",
       "   '溫志宏',\n",
       "   '楊懷卿',\n",
       "   '定勝資本股份(股)-劉軒志',\n",
       "   '張祐銘',\n",
       "   '吳祖榆',\n",
       "   '王愛菱',\n",
       "   '徐正材',\n",
       "   '豐鑽(股)-廖陳宣有',\n",
       "   '龍英投資(有)',\n",
       "   '帝豪貿易(股)-林益生',\n",
       "   '陳明龍',\n",
       "   '莊素貞',\n",
       "   '林耕州',\n",
       "   '蔡易霖',\n",
       "   '陳苡芬',\n",
       "   '李圍正',\n",
       "   '鍾振遠',\n",
       "   '曹壽民',\n",
       "   '臺灣銀行(股)-鄭士卿',\n",
       "   '林政男',\n",
       "   '日本電產株式(股)-津吉滿',\n",
       "   '何建德',\n",
       "   '蕭廣中',\n",
       "   '榮照工業(股)',\n",
       "   '張偉禮',\n",
       "   '楊欣望',\n",
       "   '蕭上智',\n",
       "   '李松田',\n",
       "   '陳兆銘',\n",
       "   '顧兆鑫',\n",
       "   '摩根梵加德新',\n",
       "   '李建憲',\n",
       "   '劉建宏',\n",
       "   '永荃投資(股)-顏文頎',\n",
       "   '吳美惠',\n",
       "   '陳契伸',\n",
       "   '黃盈圖',\n",
       "   '孫德風',\n",
       "   ...]},\n",
       " {'cluster': 2,\n",
       "  'members': ['黃瓊敏',\n",
       "   '王筱君',\n",
       "   '李政道',\n",
       "   '永宜投資(股)',\n",
       "   '張志強',\n",
       "   '吳清德',\n",
       "   '吳定國',\n",
       "   '林密',\n",
       "   '匯豐託管帕納',\n",
       "   '吳淑蕊',\n",
       "   '宜達投資(股)',\n",
       "   '王聖斌',\n",
       "   '吳劭娟',\n",
       "   '鄭宗記',\n",
       "   '吳奎雍',\n",
       "   '簡君竹',\n",
       "   '吳劭珮',\n",
       "   '鄭兆凱']}]"
      ]
     },
     "metadata": {},
     "execution_count": 22
    }
   ],
   "source": [
    "%%time\n",
    "# 使用各檔股票來做董事\b的community detection\n",
    "# 看看是否有哪些董事是同一群的\n",
    "# 也就是共同都是某些股票的董事/大股東\n",
    "# 理論上只有少數人身兼多家公司董事/大股東\n",
    "\n",
    "\n",
    "clusters = IGraph.community_walktrap(ig, steps=2).as_clustering()\n",
    "\n",
    "nodes = [{\"name\": node[\"name\"]} for node in ig.vs]\n",
    "for node in nodes:\n",
    "    idx = ig.vs.find(name=node[\"name\"]).index\n",
    "    node[\"community\"] = clusters.membership[idx]\n",
    "\n",
    "write_clusters_query = '''\n",
    "UNWIND $nodes AS n\n",
    "MATCH (p:Person) WHERE p.name = n.name\n",
    "SET p.community = toInteger(n.community)\n",
    "'''\n",
    "\n",
    "graph.run(write_clusters_query, nodes=nodes)\n",
    "\n",
    "query = '''\n",
    "MATCH (p:Person)\n",
    "WITH p.community AS cluster, collect(p.name) AS members\n",
    "WHERE cluster<>'none'\n",
    "RETURN cluster, members ORDER BY cluster ASC\n",
    "'''\n",
    "\n",
    "graph.run(query).data()[:3]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "metadata": {},
   "outputs": [
    {
     "output_type": "execute_result",
     "data": {
      "text/plain": [
       "278"
      ]
     },
     "metadata": {},
     "execution_count": 23
    }
   ],
   "source": [
    "person_clusters = graph.run(query).data()\n",
    "len(person_clusters)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "metadata": {},
   "outputs": [],
   "source": [
    "write_stock_weight_query = '''\n",
    "MATCH (p:Person)-[r:employ_of]->(s:Stock)\n",
    "RETURN p.name as person_name, r.stock_num as stock_num, s.name as stock_name\n",
    "'''\n",
    "\n",
    "data = graph.run(write_stock_weight_query).data()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "metadata": {},
   "outputs": [],
   "source": [
    "stock_query = '''\n",
    "MATCH (p:Person)-[r:employ_of]->(s:Stock)\n",
    "RETURN DISTINCT s.name as stock_name\n",
    "'''\n",
    "from collections import defaultdict\n",
    "\n",
    "total_stock_nums = defaultdict(int)\n",
    "stock_name = graph.run(stock_query).data()\n",
    "for person in data:\n",
    "    total_stock_nums[person['stock_name']] += person['stock_num']\n",
    "for person in data:\n",
    "    person['stock_ratio'] = person['stock_num']/total_stock_nums[person['stock_name']]\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "metadata": {},
   "outputs": [
    {
     "output_type": "execute_result",
     "data": {
      "text/plain": [
       "9692484"
      ]
     },
     "metadata": {},
     "execution_count": 27
    }
   ],
   "source": [
    "total_stock_nums['台積電']  # 9692484"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "metadata": {},
   "outputs": [
    {
     "output_type": "stream",
     "name": "stdout",
     "text": [
      "CPU times: user 561 ms, sys: 22.6 ms, total: 584 ms\nWall time: 8min 44s\n"
     ]
    },
    {
     "output_type": "execute_result",
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "metadata": {},
     "execution_count": 28
    }
   ],
   "source": [
    "%%time\n",
    "## Person和Stock關聯employ_of線的粗細，用股東總持股當分母，董事持股數當分子\n",
    "\n",
    "write_stock_weight_query = '''\n",
    "UNWIND $nodes AS n\n",
    "MATCH (p:Person)-[r:employ_of]->(s:Stock)\n",
    "WHERE p.name = n.person_name AND s.name = n.stock_name\n",
    "SET r.stock_ratio = n.stock_ratio\n",
    "'''\n",
    "graph.run(write_stock_weight_query, nodes=data).data()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ]
}